[
  {
    "section": "ai",
    "source": "Google News (AI topic)",
    "title": "Impacts of artificial intelligence (AI) in teaching and learning of built environment students in a developing country - Taylor & Francis Online",
    "link": "https://news.google.com/rss/articles/CBMic0FVX3lxTE84LUl2Ulp2aVFFdVRtclJiTFY2bm5SaHBVM2pJNkF4ZzhtRkN5ZUZKaUY0bC1qM0ZjbTl1cVFyWjZEUVNFeXVsb2RiY0gwdEZRU0lQdlJBYjhyb2JBdkgxU2NpZDdiY2JJeS1wTWdLdjQtQVk?oc=5",
    "summary": "Impacts of artificial intelligence (AI) in teaching and learning of built environment students in a developing country Taylor & Francis Online Impacts of artificial intelligence (AI) in teaching and learning of built environment students in a developing country Taylor & Francis Online",
    "published": "2025-10-25T03:52:55+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "U.S. Imposes Sanctions on Colombia’s Leader, One of Trump’s Harshest Critics",
    "link": "https://www.nytimes.com/2025/10/24/world/americas/us-sanctions-colombia-president-petro-drugs.html",
    "summary": "The United States Treasury Department accused President Gustavo Petro of allowing drug trafficking to flourish.",
    "published": "2025-10-25T03:50:55+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "Trump Administration Plans a Shake-Up at ICE to Speed Deportations",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/trump-deportations-ice.html",
    "summary": "The preliminary plan stems from frustration over the pace of the deportations, which are lagging behind President Trump’s demands.",
    "published": "2025-10-25T03:33:21+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "Amid the Rubble of the East Wing, Lessons in How Trump Exercises Power",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/east-wing-trump-power.html",
    "summary": "From the first day of his second term, President Trump has taken an ends-justify-the-means approach to his presidency.",
    "published": "2025-10-25T03:22:52+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "Sirikit, Glamorous Former Queen of Thailand Who Wielded Power, Dies at 93",
    "link": "https://www.nytimes.com/2025/10/24/world/asia/queen-sirikit-thailand-dead.html",
    "summary": "As the wife of King Bhumibol Adulyadej, she traveled the world charming government leaders and the public.",
    "published": "2025-10-25T02:39:23+00:00"
  },
  {
    "section": "us",
    "source": "NYT U.S.",
    "title": "J. William Middendorf II, 101, Dies; Navy Secretary and Musical Diplomat",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/j-william-middendorf-ii-dead.html",
    "summary": "A G.O.P.",
    "published": "2025-10-25T02:35:31+00:00"
  },
  {
    "section": "us",
    "source": "BBC US & Canada",
    "title": "The $500m slugger who helped Canada get to the World Series",
    "link": "https://www.bbc.com/news/articles/cn09j4xw7jeo?at_medium=RSS&at_campaign=rss",
    "summary": "For the first time in 32 years, the Toronto Blue Jays are competing in the World Series, and they have Vladimir Guerrero Jr to thank.",
    "published": "2025-10-25T02:29:17+00:00"
  },
  {
    "section": "us",
    "source": "Google News (US Nation)",
    "title": "Justice Department to monitor polling sites in six counties in California and New Jersey - CNN",
    "link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNbUFaYk8wajQyd3N3MVE0QlNjZWtYM3NOdkd2c3FDc1YyQlM2R2c2enlTNVo1SElXaEJqcXF4aDQ3cTEzTXpJRWg4ZXVrS2tsaTNaaTJDZDR6eGloRy10OThqRVgxeVlzQzRPU2tudmlnMDV1T3FZM0RrbmNVNnVkdjJTMHFtN3pfUWduNDRabUE?oc=5",
    "summary": "Justice Department to monitor polling sites in six counties in California and New Jersey CNN Justice Department Will Monitor Elections in California and New Jersey The New York Times Newsom Says Trump Is ‘Rigging the Election’ With Federal Poll Monitors KQED Trump Administration To Monitor Voting in California and New Jersey Democracy Docket Trump officials to send election observers to California and New Jersey The Guardian Justice Department to monitor polling sites in six counties in California and New Jersey CNN Justice Department Will Monitor Elections in California and New Jersey The New York Times Newsom Says Trump Is ‘Rigging the Election’ With Federal Poll Monitors KQED Trump Administration To Monitor Voting in California and New Jersey Democracy Docket Trump officials to send election observers to California and New Jersey The Guardian",
    "published": "2025-10-25T02:27:00+00:00"
  },
  {
    "section": "world",
    "source": "Google News (US Top Stories)",
    "title": "US beef prices are soaring. Will Trump's plans lower them? - BBC",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBHS3lrVDh5VC1qUjJlNmtLLXBZUnRoZXZzaklDaTJoelpLMUV0WDhvT05UQzVUNFcwMDZZNk9pOHo4UkRaXzhmTGNYVDBjMnVHeUxQZHNTQUJxd9IBX0FVX3lxTE1jeXVkMkJtdUxDX1k1WGV6bk5vR0g0Uzh5MEdfRWZhUnFZSnhiUXZVNTFfWWM4Mm9VYzg1dlprakNvV0k5NVZaVGpEMFZKZ0d0TmV2Yjh5MEJwcEY0Q2ZV?oc=5",
    "summary": "US beef prices are soaring.",
    "published": "2025-10-25T02:16:06+00:00"
  },
  {
    "section": "world",
    "source": "BBC World",
    "title": "Venezuela's Maduro says US 'fabricating war' as it deploys world's largest warship",
    "link": "https://www.bbc.com/news/articles/c891gzx7xn4o?at_medium=RSS&at_campaign=rss",
    "summary": "The deployment of the USS Gerald R Ford marks a major escalation in what the US says is a campaign to target drug traffickers.",
    "published": "2025-10-25T02:16:00+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "U.S. Details How Mob and Ex-NBA Players Lured High Rollers Into Poker Trap",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/nba-mafia-rigged-poker-games.html",
    "summary": "A Manhattan apartment was at the center of a Mafia-run ring that used former N.B.A.",
    "published": "2025-10-25T01:54:28+00:00"
  },
  {
    "section": "us",
    "source": "Google News (US Nation)",
    "title": "Federal appeals court temporarily bars Portland troop deployment - Oregon Public Broadcasting - OPB",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNdkVQTnVoWHd1Y0g0cG9iazhwVUNRMTFMSkFiN0d4ZjJGVzZkR25mRFI1VVNrMTI2ZTh1RW1kT3doMklmN0ZMRjItbVVoTUVfVHNYakFWMWRRQ2ttM3J1Q1B6U0lkbEhuOU1iRWRUbU9RMk5yVS1JQkVEdzBfcWlueWkzMG9yS044WGFLdXh2cnBLMnY3VnA0dnlZREREYld2dmxaajhQUHc2dmlhSllmUg?oc=5",
    "summary": "Federal appeals court temporarily bars Portland troop deployment Oregon Public Broadcasting - OPB ‘Friends and neighbors’: Oregon Guard chief describes who Portland’s deployed troops really are KGW 9th Circuit pauses troop deployments to Portland until Tuesday KPTV Portland judge rejects Trump request to allow national guard deployment The Guardian Troop deployment to Portland delayed as appeals court considers review KATU Federal appeals court temporarily bars Portland troop deployment Oregon Public Broadcasting - OPB ‘Friends and neighbors’: Oregon Guard chief describes who Portland’s deployed troops really are KGW 9th Circuit pauses troop deployments to Portland until Tuesday KPTV Portland judge rejects Trump request to allow national guard deployment The Guardian Troop deployment to Portland delayed as appeals court considers review KATU",
    "published": "2025-10-25T01:37:55+00:00"
  },
  {
    "section": "us",
    "source": "Google News (US Nation)",
    "title": "Bannon Claims ‘There Is a Plan’ for Trump to Run for a Third Term - The New York Times",
    "link": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQeEQ2RXZ2MTQ1aUNoQ2ctUUtWSDBkaFJsc2JYVlpSRXhYU2Q3ZGk3bm0wRC1uT2ROTU1YZGdCdDllbi02ZHg4dVZKRzJJZUlwLVJieE5oLW5kUXRnMm1hWklwR2dSV002c0VQODBBTXpWSkxDaktoVlBkNi1jcENmSHE4T21aNVEyMXFrRWhn?oc=5",
    "summary": "Bannon Claims ‘There Is a Plan’ for Trump to Run for a Third Term The New York Times Steve Bannon says ‘there is a plan’ for Trump to be president in 2028: ‘We had longer odds in 2016 and 2024’ The Independent Trump will return to White House for 3rd term in 2028: Former aide Anadolu Ajansı 👑 Trump's Third Term?",
    "published": "2025-10-25T01:29:12+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "Bannon Claims ‘There Is a Plan’ for Trump to Run for a Third Term",
    "link": "https://www.nytimes.com/2025/10/24/us/politics/president-trump-2028-steve-bannon.html",
    "summary": "The claim comes after months of President Trump toying with the idea, insisting that he is “not joking” about defying a constitutionally-mandated term limit.",
    "published": "2025-10-25T01:29:12+00:00"
  },
  {
    "section": "world",
    "source": "Google News (US Top Stories)",
    "title": "Trump administration aims to auction offshore oil leases along U.S. coastlines that have been off-limits for decades - CBS News",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1odzhTZ3M2aUpnQkJGbk53dzRCNmFoREF6UHktQTI0QUg5eWtTdzlCRWJ0V0YxSUF3dm0xcVpZM1dHRHFxOFVoN3lqUGpTVHNYeWd2UWk0cEZLVmhGYnRST1pwMTZfRHZBM00wNm9tQXRJNU0zRnRzYtIBfkFVX3lxTE9saXBCOTFWbm1EZ3lrTVBGUXZqZElIbGtEZEZUa0hUYjZCN3AxbW9tdnBGaEpiVWRuSXR6dzJxNjVvTTJ1ZUdoOEpoMlVGMkNvUEdCMGFLclc4NlE0Q241M0VhQTgxN29VZkthdEFrbnFaS2cxOTJ0S0ZzLWJodw?oc=5",
    "summary": "Trump administration aims to auction offshore oil leases along U.S.",
    "published": "2025-10-25T01:20:43+00:00"
  },
  {
    "section": "us",
    "source": "NYT U.S.",
    "title": "Jury Awards $42 Million in Death of Inmate at Private Jail in Louisiana",
    "link": "https://www.nytimes.com/2025/10/24/us/louisiana-prison-death-verdict.html",
    "summary": "Erie Moore, a retired millworker and father of three, died in 2015, a month after guards slammed him headfirst to the floor at the Richwood Correctional Center, lawyers for his family said.",
    "published": "2025-10-25T01:17:21+00:00"
  },
  {
    "section": "world",
    "source": "Google News (US Top Stories)",
    "title": "Shots fired, driver hurt and held after truck rams into Coast Guard base in California - AP News",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQX3NnV1FwLXkycTdKdUFrQlhzV3pHVWpSVC1sbzdSSHgwSFN4eFZxM20ySzF5RDJqT0I1VXRsNTBpNXNadUozdENtdEk0d0loMFExT24tVkJqNWp2ZzZ5ZVJ6elYtb3kyRVFJejN2ZlBIRC00amFqYU5ncWxaTlBxSmJRTkhYSl92eTQ0aTFlNk9xbUhIZEVpS1Ffb1hVbHQ3anFnb3Q0VlUxTjE5V1BFNzZfWQ?oc=5",
    "summary": "Shots fired, driver hurt and held after truck rams into Coast Guard base in California AP News 2 injured after shots fired at U-Haul truck backing into US Coast Guard base in Alameda amid protests over federal agents ABC7 San Francisco 2 People Shot at Protest Site Outside Coast Guard Base in California The New York Times WATCH: Noem warns National Guard could be deployed after truck-ramming incident in San Francisco PBS Coast Guard fires at U-Haul in Oakland amid immigration protest; driver in FBI custody KTVU Shots fired, driver hurt and held after truck rams into Coast Guard base in California AP News 2 injured after shots fired at U-Haul truck backing into US Coast Guard base in Alameda amid protests over federal agents ABC7 San Francisco 2 People Shot at Protest Site Outside Coast Guard Base in California The New York Times WATCH: Noem warns National Guard could be deployed after truck-ramming incident in San Francisco PBS Coast Guard fires at U-Haul in Oakland amid immigration protest; driver in FBI custody KTVU",
    "published": "2025-10-25T01:15:00+00:00"
  },
  {
    "section": "world",
    "source": "NYT Home/Top",
    "title": "Mamdani Says Rivals Are Pushing Hate as Mayor’s Race Enters Last Stretch",
    "link": "https://www.nytimes.com/2025/10/24/nyregion/mamdani-cuomo-muslim-mayor.html",
    "summary": "Zohran Mamdani’s opponents, Andrew Cuomo and Curtis Sliwa, denied accusations that they are stoking Islamophobia with their rhetoric and actions.",
    "published": "2025-10-25T01:12:18+00:00"
  },
  {
    "section": "world",
    "source": "Google News (US Top Stories)",
    "title": "With East Wing gone, questions now turn to Trump’s ballroom donors - The Washington Post",
    "link": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPYXlHQUNsaF83TmFtSndabVBWaXdmLXpQbEgxdlhxWjF2VkRXUkhOOTBxaHRfVGZxZXIxenpHSFVaR3MyS2lCX2dMRDQ1dmQ4WlNJNGMyNjdPY0F2RDA2bVprYktGOGRhbEhMeHBYellQaGZfckdqam9CMWZ6d19uRmZhbE8zejdVQ09Zd1M1QnpUSmMz?oc=5",
    "summary": "With East Wing gone, questions now turn to Trump’s ballroom donors The Washington Post White House responds to reports Trump named new ballroom after himself Fox News ‘Real Time’: Bill Maher Calls White House “Just A Building” After Trump Demolishes East Wing Deadline Brooks and Atkins Stohr on the East Wing demolition PBS At least 2 historic magnolia trees, Kennedy Garden appear to have been removed to make way for Trump's White House ballroom ABC News - Breaking News, Latest News and Videos With East Wing gone, questions now turn to Trump’s ballroom donors The Washington Post White House responds to reports Trump named new ballroom after himself Fox News ‘Real Time’: Bill Maher Calls White House “Just A Building” After Trump Demolishes East Wing Deadline Brooks and Atkins Stohr on the East Wing demolition PBS At least 2 historic magnolia trees, Kennedy Garden appear to have been removed to make way for Trump's White House ballroom ABC News - Breaking News, Latest News and Videos",
    "published": "2025-10-25T01:10:01+00:00"
  },
  {
    "section": "world",
    "source": "Google News (US Top Stories)",
    "title": "A Traders Guide to What to Expect Ahead of Trump’s Asia Trip and Xi Meeting - Bloomberg.com",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPYk43VlhtUTNLME5scm0xRjFqT0dWNzBudnVUcmJBWk16amIxTkJOWG9YUmZXZ0tXcUNQenREQlkyVk5IRW9PbWpHaTk2QVRyc0hlS0wxangwQmRFemMzaGZVYll6ci1vYWpadXltd0s2bkVqb2NJX2cyeTFPMFIteGw5cmZNajJXSzVTUEVtejB4b2RvaTVWTVBBY1JGdTlHRklGVU9IcWNFOTlvQ19FVFJaY2JJR2MwMmdKbnFWSGxqYXhR?oc=5",
    "summary": "A Traders Guide to What to Expect Ahead of Trump’s Asia Trip and Xi Meeting Bloomberg.com ‘Throw of the iron dice’: Inside Trump’s most perilous foreign trip yet Politico Trump travels to Asia amid government shutdown dw.com Trump seeks trade deal with Xi during Asia trip Reuters Trump Leaves Behind a Reeling Washington to Chase a Deal With China The New York Times A Traders Guide to What to Expect Ahead of Trump’s Asia Trip and Xi Meeting Bloomberg.com ‘Throw of the iron dice’: Inside Trump’s most perilous foreign trip yet Politico Trump travels to Asia amid government shutdown dw.com Trump seeks trade deal with Xi during Asia trip Reuters Trump Leaves Behind a Reeling Washington to Chase a Deal With China The New York Times",
    "published": "2025-10-25T01:10:00+00:00"
  }
]